Repository: waldhacker/pseudify-page
Catalog: src/translations/messages.*.xlf
Languages: de

source: Language navigation
de: Sprachnavigation

source: Pseudonymize your
de: Pseudonymisiere Deine

source: Database
de: Datenbank

source: Install
de: Installieren

source: Documentation
de: Dokumentation

source: Pseudonymize
de: Pseudonymisiere

source: All in one solution
de: Alles in einer Lösung

source: Your pseudonymization toolbox
de: Dein Werkzeugkasten zur Pseudonymisierung

source: Sponsored by
de: Gefördert durch

source: Legal
de: Rechtliches

source: Imprint
de: Impressum

source: Analyze
de: Analysiere

source: Modeling
de: Modelliere

source: Protect your data and the data of others. Pseudonymize your databases before exporting them to other systems. Pseudify helps you with this task.
de: Schütze Deine Daten und die Daten anderer. Pseudonymisiere Deine Datenbanken, bevor Du sie in andere Systeme exportierst. Pseudify hilft Dir bei dieser Aufgabe.

source: Supported by
de: Unterstützt durch

source: 3 steps to more data privacy
de: In 3 Schritten zu mehr Datenschutz

source: Easy to use
de: Einfache Handhabung

source: Pseudify brings you to pseudonymized databases in 3 comfortable steps. Pseudify helps you to find and pseudonymize hidden personal data, even and especially in complex and encoded data structures.
de: Pseudify bringt Dich in 3 komfortablen Schritten zu pseudonymisierten Datenbanken. Pseudify hilft Dir, versteckte personenbezogene Daten zu finden und zu pseudonymisieren, auch und gerade in komplexen und enkodierten Datenstrukturen.

source: Model profiles for any application
de: Modelliere Profile für beliebige Applikation

source: These profiles allow you to search your entire database for data you define. The profiles allow you to search in encoded database columns like hexadecimal encoded data and in complex data structures like JSON or serialized PHP data.
de: Mit diesen Profilen kannst Du Deine gesamte Datenbank nach von Dir definierten Daten durchsuchen. Die Profile ermöglichen Dir die Suche in kodierten Datenbankspalten, z.B. in hexadezimal kodierte Daten und in komplexen Datenstrukturen, z.B. in JSON oder serialisierten PHP-Daten.

source: The analysis and pseudonymization profiles can be modeled with a "fluent interface". Define the encodings of the database columns and, in complex cases, your own logics to obtain the plaintext of the database columns to analyze or pseudonymize.
de: Die Analyse- und Pseudonymisierungsprofile können mit einer "sprechenden Schnittstelle" modelliert werden. Definiere die Kodierungen der Datenbankspalten und, in komplexen Fällen, Deine eigenen Logiken, um den Klartext der Datenbankspalten zu erhalten, um ihn zu analysieren oder zu pseudonymisieren.

source: These profiles allow you to pseudonymize the data specifically. User names still look like user names after pseudonymization, e-mail addresses still look like e-mail addresses afterwards. Identical input data generates identical pseudonyms. Also pseudonymize data in complex data structures like JSON or serialized PHP data.
de: Diese Profile ermöglichen es Dir, die Daten gezielt zu pseudonymisieren. Benutzernamen sehen nach der Pseudonymisierung immer noch wie Benutzernamen aus, E-Mail-Adressen sehen danach immer noch wie E-Mail-Adressen aus. Gleiche Eingabedaten erzeugen gleiche Pseudonyme. Pseudonymisiere auch Daten in komplexen Datenstrukturen wie JSON oder serialisierte PHP-Daten.

source: The application must use a supported database.
de: Die Applikation muss eine unterstützte Datenbank verwenden.

source: From devops
de: Von DevOps

source: for devops
de: für DevOps

source: Pseudify is ideal for use in virtualized environments with Docker. Many database drivers are already installed in the Pseudify Docker container, allowing quick integration into your CI system.
de: Pseudify ist ideal für den Einsatz in virtualisierten Umgebungen mit Docker. Viele Datenbanktreiber sind bereits im Pseudify Docker Container installiert, so dass eine schnelle Integration in Dein CI-System möglich ist.

source: Everything from database drivers to fakedata generators is included.
de: Vom Datenbanktreiber bis zum Fakedatengenerator ist alles enthalten.

source: Extensibility
de: Erweiterbarkeit

source: Application agnostic
de: Applikationsagnostisch

source: Large range of functions
de: Großer Funktionsumfang

source: Free to use
de: Frei verwendbar

source: No license costs
de: Keine Lizenzkosten

source: Self hosted
de: Selbst gehostet

source: 100+ fake data formats
de: 100+ Fake-Datenformate

source: 7+ supported database platforms
de: 7+ unterstützte Datenbanken

source: 12+ data encoders
de: 12+ Datenenkodierer

source: extensible fake data formats
de: erweiterbare Fake-Datenformate

source: extensible data encoder
de: erweiterbare Datenkodierer

source: extensible database types
de: erweiterbare Datenbanktypen

source: Close
de: Schließen

source: Data privacy
de: Datenschutz
